test_app/app/views/messages/index.html.erb

SELECT "messages".* FROM "messages"
---

  Dexie.liveQuery(() => db.messages.toArray()).subscribe({
    next: (messages) => {
      messagesDiv.innerHTML = messages.map(m => `<p data-id="${m.id}">${m.body}</p>`).join("");
    },
    error: (err) => console.error("liveQuery error:", err)
  });